ramseymcgrath/Hurricane/lib/hurricane/hw/boards/lpc5500/usb_hw_hal_host_lpc55s69.c
/**
 * @file usb_hw_hal_host_lpc55s69.c
 * @brief LPC55S69-specific USB host HAL implementation
 * 
 * This file implements the host-mode USB HAL functions for the LPC55S69 platform
 * using the NXP SDK. It uses the USB1 controller in host mode (High Speed EHCI).
 */

#include "hw/hurricane_hw_hal.h"
#include <stdlib.h>
#include <string.h>
#include <stdio.h>

// NXP SDK includes
#include "fsl_device_registers.h"
#include "fsl_debug_console.h"
#include "fsl_common.h"
#include "fsl_power.h"
#include "fsl_clock.h"
#include "fsl_reset.h"
#include "usb_host_config.h"
#include "usb.h"
#include "usb_host.h"
#include "usb_host_hid.h"
#include "usb_phy.h"

//==============================================================================
// Private definitions and variables
//==============================================================================

// USB host controller handle
static usb_host_handle host_handle;

// Host stack status
static bool host_initialized = false;
static bool device_connected = false;
static bool device_enumerated = false;
static uint8_t device_address = 0;

// Enumeration state machine
typedef enum {
    ENUM_STATE_IDLE,                  // No enumeration in progress
    ENUM_STATE_GET_DEVICE_DESC,       // Getting device descriptor (short)
    ENUM_STATE_GET_FULL_DEVICE_DESC,  // Getting full device descriptor
    ENUM_STATE_GET_CONFIG_DESC,       // Getting configuration descriptor (header)
    ENUM_STATE_GET_FULL_CONFIG_DESC,  // Getting full configuration descriptor
    ENUM_STATE_SET_ADDRESS,           // Setting device address
    ENUM_STATE_SET_CONFIGURATION,     // Setting device configuration
    ENUM_STATE_COMPLETE               // Enumeration completed
} enum_state_t;

// Enumeration tracking
static enum_state_t enum_state = ENUM_STATE_IDLE;
static uint8_t enum_retries = 0;
static uint16_t enum_config_total_length = 0;

// Device information
typedef struct {
    uint16_t vendor_id;
    uint16_t product_id;
    uint8_t device_class;
    uint8_t device_subclass;
    uint8_t device_protocol;
    uint8_t max_packet_size;
    uint8_t num_configurations;
    uint8_t current_config;
    uint8_t interface_count;
    // Buffer to store descriptors during enumeration
    uint8_t descriptor_buffer[512];
} device_info_t;

static device_info_t device_info;

// Transfer buffer for control and interrupt transfers
#define TRANSFER_BUFFER_SIZE 1024
static uint8_t transfer_buffer[TRANSFER_BUFFER_SIZE];

// Forward declarations
static void USB_HostCallback(usb_host_handle handle,
                            uint32_t event,
                            void *param);
static void USB_HostHidCallback(void* param,
                               uint8_t* buffer,
                               uint32_t length);
static void process_enumeration_state(void);
static usb_status_t get_device_descriptor(bool full);
static usb_status_t get_config_descriptor(bool full);
static usb_status_t set_device_address(uint8_t address);
static usb_status_t set_device_configuration(uint8_t config);
static void parse_device_descriptor(void);
static void parse_config_descriptor(void);
static void handle_enumeration_error(usb_status_t status);

// External declarations from initialization file
extern void usb_host_hw_init(void);
extern void USB_HostIsrEnable(void);

//==============================================================================
// Public HAL functions
//==============================================================================

void hurricane_hw_host_init(void)
{
    if (host_initialized) {
        printf("[LPC55S69-Host] Host already initialized\n");
        return;
    }

    usb_status_t status = kStatus_USB_Success;

    // Initialize USB1 hardware (High-Speed EHCI)
    usb_host_hw_init();

    // Initialize host controller
    status = USB_HostInit(kUSB_ControllerEhci1, &host_handle, USB_HostCallback);
    if (kStatus_USB_Success != status) {
        printf("[LPC55S69-Host] USB host controller initialization failed\n");
        return;
    }

    // Enable IRQ
    USB_HostIsrEnable();

    host_initialized = true;
    device_connected = false;
    device_enumerated = false;
    enum_state = ENUM_STATE_IDLE;
    
    // Clear device info
    memset(&device_info, 0, sizeof(device_info));
    
    printf("[LPC55S69-Host] USB host initialized (High-Speed)\n");
}

void hurricane_hw_host_poll(void)
{
    if (!host_initialized) {
        return;
    }
    
    // Call USB host tasks
    USB_HostTaskFn(host_handle);
    
    // Handle enumeration state machine if active
    if (enum_state != ENUM_STATE_IDLE && enum_state != ENUM_STATE_COMPLETE) {
        process_enumeration_state();
    }
}

int hurricane_hw_host_device_connected(void)
{
    return (device_connected && device_enumerated) ? 1 : 0;
}

void hurricane_hw_host_reset_bus(void)
{
    if (!host_initialized) {
        printf("[LPC55S69-Host] Host not initialized\n");
        return;
    }
    
    usb_status_t status = USB_HostResetDevice(host_handle, device_address);
    
    if (status != kStatus_USB_Success) {
        printf("[LPC55S69-Host] Failed to reset USB bus: %d\n", status);
    } else {
        printf("[LPC55S69-Host] USB bus reset initiated\n");
    }
}

int hurricane_hw_host_control_transfer(
    const hurricane_usb_setup_packet_t* setup,
    void* buffer,
    uint16_t length)
{
    if (!host_initialized || !device_connected || !device_enumerated) {
        printf("[LPC55S69-Host] Host not initialized or device not connected\n");
        return -1;
    }
    
    if (!setup) {
        printf("[LPC55S69-Host] Invalid setup packet\n");
        return -1;
    }
    
    usb_host_transfer_t* transfer;
    
    // Allocate transfer
    if (USB_HostMallocTransfer(host_handle, &transfer) != kStatus_USB_Success) {
        printf("[LPC55S69-Host] Failed to allocate transfer\n");
        return -1;
    }
    
    // Setup the transfer
    transfer->transferBuffer = buffer ? buffer : transfer_buffer;
    transfer->transferLength = length;
    transfer->callbackFn = USB_HostHidCallback;
    transfer->callbackParam = NULL;
    
    // Create setup packet
    usb_host_transfer_setup_t* setup_packet = (usb_host_transfer_setup_t*)transfer->setupPacket;
    setup_packet->bmRequestType = setup->bmRequestType;
    setup_packet->bRequest = setup->bRequest;
    setup_packet->wValue = USB_SHORT_TO_LITTLE_ENDIAN(setup->wValue);
    setup_packet->wIndex = USB_SHORT_TO_LITTLE_ENDIAN(setup->wIndex);
    setup_packet->wLength = USB_SHORT_TO_LITTLE_ENDIAN(setup->wLength);
    
    // Send the control request
    usb_status_t status = USB_HostSendControlRequest(host_handle, device_address, transfer);
    
    if (status != kStatus_USB_Success) {
        USB_HostFreeTransfer(host_handle, transfer);
        printf("[LPC55S69-Host] Failed to send control request: %d\n", status);
        return -1;
    }
    
    // Wait for transfer completion by blocking TODO: should be asynchronous
    volatile bool transfer_complete = false;
    uint32_t timeout = 5000;  // 5 seconds timeout
    
    while (!transfer_complete && timeout > 0) {
        // Poll USB host tasks
        USB_HostTaskFn(host_handle);
        
        // Check if transfer is complete
        if (transfer->transferSofar > 0) {
            transfer_complete = true;
        }
        
        // Delay
        for (volatile int i = 0; i < 10000; i++) {
            __asm("nop");
        }
        
