ramseymcgrath/Hurricane/lib/hurricane/hw/boards/lpc5500/usb_hw_hal_host_lpc55s69.c
        timeout--;
    }
    
    if (!transfer_complete) {
        printf("[LPC55S69-Host] Control transfer timed out\n");
        USB_HostCancelTransfer(host_handle, device_address, transfer);
        return -1;
    }
    
    // Return the number of bytes transferred
    return transfer->transferSofar;
}

int hurricane_hw_host_interrupt_in_transfer(
    uint8_t endpoint,
    void* buffer,
    uint16_t length)
{
    if (!host_initialized || !device_connected || !device_enumerated) {
        printf("[LPC55S69-Host] Host not initialized or device not connected\n");
        return -1;
    }
    
    // Make sure this is an IN endpoint
    if (!(endpoint & 0x80)) {
        printf("[LPC55S69-Host] Invalid IN endpoint 0x%02x\n", endpoint);
        return -1;
    }
    
    usb_host_transfer_t* transfer;
    
    // Allocate transfer
    if (USB_HostMallocTransfer(host_handle, &transfer) != kStatus_USB_Success) {
        printf("[LPC55S69-Host] Failed to allocate transfer\n");
        return -1;
    }
    
    // Setup the transfer
    transfer->transferBuffer = buffer ? buffer : transfer_buffer;
    transfer->transferLength = length;
    transfer->callbackFn = USB_HostHidCallback;
    transfer->callbackParam = NULL;
    
    // Send the interrupt request
    usb_status_t status = USB_HostSendSetup(
        host_handle,
        device_address,
        endpoint & 0x0F,  // Endpoint number
        USB_ENDPOINT_INTERRUPT,
        USB_IN,
        length,
        transfer
    );
    
    if (status != kStatus_USB_Success) {
        USB_HostFreeTransfer(host_handle, transfer);
        printf("[LPC55S69-Host] Failed to send interrupt request: %d\n", status);
        return -1;
    }
    
    // Wait for transfer completion by blocking TODO: should be asynchronous
    volatile bool transfer_complete = false;
    uint32_t timeout = 1000;  // 1 second timeout
    
    while (!transfer_complete && timeout > 0) {
        // Poll USB host tasks
        USB_HostTaskFn(host_handle);
        
        // Check if transfer is complete
        if (transfer->transferSofar > 0) {
            transfer_complete = true;
        }
        
        // Delay
        for (volatile int i = 0; i < 10000; i++) {
            __asm("nop");
        }
        
        timeout--;
    }
    
    if (!transfer_complete) {
        printf("[LPC55S69-Host] Interrupt transfer timed out\n");
        USB_HostCancelTransfer(host_handle, device_address, transfer);
        return -1;
    }
    
    // Return the number of bytes transferred
    return transfer->transferSofar;
}

/**
 * @brief Perform a USB interrupt OUT transfer in host mode
 *
 * @param endpoint Endpoint address
 * @param buffer Data buffer
 * @param length Length of data buffer
 * @return Number of bytes transferred, or negative error code
 */
int hurricane_hw_host_interrupt_out_transfer(
    uint8_t endpoint,
    void* buffer,
    uint16_t length)
{
    if (!host_initialized || !device_connected || !device_enumerated) {
        printf("[LPC55S69-Host] Host not initialized or device not connected\n");
        return -1;
    }
    
    // Make sure this is an OUT endpoint
    if (endpoint & 0x80) {
        printf("[LPC55S69-Host] Invalid OUT endpoint 0x%02x\n", endpoint);
        return -1;
    }
    
    usb_host_transfer_t* transfer;
    
    // Allocate transfer
    if (USB_HostMallocTransfer(host_handle, &transfer) != kStatus_USB_Success) {
        printf("[LPC55S69-Host] Failed to allocate transfer\n");
        return -1;
    }
    
    // Setup the transfer
    transfer->transferBuffer = buffer ? buffer : transfer_buffer;
    transfer->transferLength = length;
    transfer->callbackFn = USB_HostHidCallback;
    transfer->callbackParam = NULL;
    
    // Send the interrupt request
    usb_status_t status = USB_HostSendSetup(
        host_handle,
        device_address,
        endpoint & 0x0F,  // Endpoint number
        USB_ENDPOINT_INTERRUPT,
        USB_OUT,
        length,
        transfer
    );
    
    if (status != kStatus_USB_Success) {
        USB_HostFreeTransfer(host_handle, transfer);
        printf("[LPC55S69-Host] Failed to send interrupt OUT request: %d\n", status);
        return -1;
    }
    
    // Wait for transfer completion by blocking TODO: should be asynchronous
    volatile bool transfer_complete = false;
    uint32_t timeout = 1000;  // 1 second timeout
    
    while (!transfer_complete && timeout > 0) {
        // Poll USB host tasks
        USB_HostTaskFn(host_handle);
        
        // Check if transfer is complete
        if (transfer->transferSofar > 0) {
            transfer_complete = true;
        }
        
        // Delay
        for (volatile int i = 0; i < 10000; i++) {
            __asm("nop");
        }
        
        timeout--;
    }
    
    if (!transfer_complete) {
        printf("[LPC55S69-Host] Interrupt OUT transfer timed out\n");
        USB_HostCancelTransfer(host_handle, device_address, transfer);
        return -1;
    }
    
    // Return the number of bytes transferred
    return transfer->transferSofar;
}

//==============================================================================
// Private functions
//==============================================================================

static void USB_HostCallback(usb_host_handle handle,
                            uint32_t event,
                            void *param)
{
    usb_status_t status = kStatus_USB_Success;
    
    switch (event) {
        case kUSB_HostEventAttach:
            device_connected = true;
            device_enumerated = false;
            device_address = (uint8_t)(*(uint32_t *)param);
            
            printf("[LPC55S69-Host] USB device attached. Address: %d\n", device_address);
            
            // Start the enumeration process
            memset(&device_info, 0, sizeof(device_info));
            enum_state = ENUM_STATE_GET_DEVICE_DESC;
            enum_retries = 0;
            
            // Trigger the first state of enumeration
            process_enumeration_state();
            break;
            
