ramseymcgrath/Hurricane/lib/hurricane/hw/boards/lpc5500/usb_hw_hal_host_lpc55s69.c
        case kUSB_HostEventDetach:
            device_connected = false;
            device_enumerated = false;
            device_address = 0;
            enum_state = ENUM_STATE_IDLE;
            
            printf("[LPC55S69-Host] USB device detached\n");
            break;
            
        case kUSB_HostEventEnumerationDone:
            // This event may be triggered by the NXP USB stack's internal enumeration
            // If we're using our own enumeration, we should check our state
            if (enum_state == ENUM_STATE_COMPLETE) {
                device_enumerated = true;
                printf("[LPC55S69-Host] USB enumeration completed successfully\n");
                printf("[LPC55S69-Host] Device VID:PID = %04x:%04x, Class: %02x\n",
                       device_info.vendor_id, device_info.product_id, device_info.device_class);
            } else {
                printf("[LPC55S69-Host] Received enumeration done event but our state is %d\n", enum_state);
                // Try to recover by moving to complete state
                enum_state = ENUM_STATE_COMPLETE;
                device_enumerated = true;
            }
            break;
            
        default:
            // Unhandled event
            break;
    }
}

/**
 * @brief Process the current enumeration state
 *
 * This function implements the state machine for USB device enumeration.
 */
static void process_enumeration_state(void)
{
    usb_status_t status = kStatus_USB_Success;
    
    if (!device_connected) {
        enum_state = ENUM_STATE_IDLE;
        return;
    }
    
    switch (enum_state) {
        case ENUM_STATE_IDLE:
            // Nothing to do
            break;
            
        case ENUM_STATE_GET_DEVICE_DESC:
            // Get the device descriptor (short version first to get max packet size)
            status = get_device_descriptor(false);
            if (status == kStatus_USB_Success) {
                parse_device_descriptor();
                enum_state = ENUM_STATE_SET_ADDRESS;
            } else {
                handle_enumeration_error(status);
            }
            break;
            
        case ENUM_STATE_GET_FULL_DEVICE_DESC:
            // Get the full device descriptor now that we have the address set
            status = get_device_descriptor(true);
            if (status == kStatus_USB_Success) {
                parse_device_descriptor();
                enum_state = ENUM_STATE_GET_CONFIG_DESC;
            } else {
                handle_enumeration_error(status);
            }
            break;
            
        case ENUM_STATE_SET_ADDRESS:
            // Set the device address (typically 1)
            status = set_device_address(1);
            if (status == kStatus_USB_Success) {
                enum_state = ENUM_STATE_GET_FULL_DEVICE_DESC;
                // Need a small delay to allow device to process SET_ADDRESS
                for (volatile int i = 0; i < 100000; i++) {
                    __asm("nop");
                }
            } else {
                handle_enumeration_error(status);
            }
            break;
            
        case ENUM_STATE_GET_CONFIG_DESC:
            // Get the configuration descriptor header first
            status = get_config_descriptor(false);
            if (status == kStatus_USB_Success) {
                enum_state = ENUM_STATE_GET_FULL_CONFIG_DESC;
            } else {
                handle_enumeration_error(status);
            }
            break;
            
        case ENUM_STATE_GET_FULL_CONFIG_DESC:
            // Get the full configuration descriptor including all interfaces
            status = get_config_descriptor(true);
            if (status == kStatus_USB_Success) {
                parse_config_descriptor();
                enum_state = ENUM_STATE_SET_CONFIGURATION;
            } else {
                handle_enumeration_error(status);
            }
            break;
            
        case ENUM_STATE_SET_CONFIGURATION:
            // Set the configuration (typically 1)
            status = set_device_configuration(1);
            if (status == kStatus_USB_Success) {
                enum_state = ENUM_STATE_COMPLETE;
                device_enumerated = true;
                printf("[LPC55S69-Host] Enumeration completed successfully\n");
            } else {
                handle_enumeration_error(status);
            }
            break;
            
        case ENUM_STATE_COMPLETE:
            // Enumeration is complete, nothing more to do
            break;
    }
}

/**
 * @brief Get the device descriptor from the connected USB device
 *
 * @param full If true, get the full descriptor. If false, just get the first 8 bytes.
 * @return usb_status_t Status of the operation
 */
static usb_status_t get_device_descriptor(bool full)
{
    uint16_t length = full ? 18 : 8; // Full descriptor or just enough for max packet size
    
    // Setup packet for GET_DESCRIPTOR (Device)
    hurricane_usb_setup_packet_t setup = {
        .bmRequestType = 0x80,  // Device-to-host, standard, device
        .bRequest = 0x06,       // GET_DESCRIPTOR
        .wValue = 0x0100,       // Device descriptor, index 0
        .wIndex = 0x0000,       // Not used for device descriptor
        .wLength = length
    };
    
    printf("[LPC55S69-Host] Getting %s device descriptor\n", full ? "full" : "short");
    
    // Send control transfer to get the descriptor
    int result = hurricane_hw_host_control_transfer(
        &setup,
        device_info.descriptor_buffer,
        length
    );
    
    if (result < 0 || result < length) {
        printf("[LPC55S69-Host] Failed to get device descriptor: %d\n", result);
        return kStatus_USB_Error;
    }
    
    return kStatus_USB_Success;
}

/**
 * @brief Parse the device descriptor to extract needed information
 */
static void parse_device_descriptor(void)
{
    // Check if we have at least the minimum device descriptor size
    if (device_info.descriptor_buffer[0] < 8) {
        printf("[LPC55S69-Host] Invalid device descriptor length: %d\n", device_info.descriptor_buffer[0]);
        return;
    }
    
    // Extract information from device descriptor
    uint8_t* desc = device_info.descriptor_buffer;
    
