ramseymcgrath/Hurricane/lib/hurricane/hw/boards/lpc5500/usb_hw_hal_host_lpc55s69.c
    // First 8 bytes are always available
    device_info.max_packet_size = desc[7];
    
    // Full descriptor fields
    if (desc[0] >= 18) {
        device_info.vendor_id = (desc[8] | (desc[9] << 8));
        device_info.product_id = (desc[10] | (desc[11] << 8));
        device_info.device_class = desc[4];
        device_info.device_subclass = desc[5];
        device_info.device_protocol = desc[6];
        device_info.num_configurations = desc[17];
    }
}

/**
 * @brief Get the configuration descriptor from the connected USB device
 *
 * @param full If true, get the full descriptor. If false, just get the header.
 * @return usb_status_t Status of the operation
 */
static usb_status_t get_config_descriptor(bool full)
{
    // For the header, we need at least 9 bytes (configuration descriptor header)
    uint16_t length = full ? enum_config_total_length : 9;
    
    // Setup packet for GET_DESCRIPTOR (Configuration)
    hurricane_usb_setup_packet_t setup = {
        .bmRequestType = 0x80,  // Device-to-host, standard, device
        .bRequest = 0x06,       // GET_DESCRIPTOR
        .wValue = 0x0200,       // Configuration descriptor, index 0
        .wIndex = 0x0000,       // Not used for configuration descriptor
        .wLength = length
    };
    
    printf("[LPC55S69-Host] Getting %s configuration descriptor\n", full ? "full" : "header");
    
    // Send control transfer to get the descriptor
    int result = hurricane_hw_host_control_transfer(
        &setup,
        device_info.descriptor_buffer,
        length
    );
    
    if (result < 0 || result < 9) {
        printf("[LPC55S69-Host] Failed to get configuration descriptor: %d\n", result);
        return kStatus_USB_Error;
    }
    
    // If we're just getting the header, extract the total length for next request
    if (!full) {
        enum_config_total_length = (device_info.descriptor_buffer[2] | (device_info.descriptor_buffer[3] << 8));
        device_info.interface_count = device_info.descriptor_buffer[4];
        printf("[LPC55S69-Host] Config descriptor total length: %d, interfaces: %d\n",
               enum_config_total_length, device_info.interface_count);
    }
    
    return kStatus_USB_Success;
}

/**
 * @brief Parse the configuration descriptor to extract needed information
 */
static void parse_config_descriptor(void)
{
    // Basic validation
    if (device_info.descriptor_buffer[0] < 9) {
        printf("[LPC55S69-Host] Invalid config descriptor length: %d\n", device_info.descriptor_buffer[0]);
        return;
    }
    
    // Extract configuration value
    device_info.current_config = device_info.descriptor_buffer[5];
    
    // Full descriptor parsing could be implemented here if needed
    // For now, we just extract the basic configuration information
    printf("[LPC55S69-Host] Configuration value: %d\n", device_info.current_config);
}

/**
 * @brief Set the USB device address
 *
 * @param address The address to set
 * @return usb_status_t Status of the operation
 */
static usb_status_t set_device_address(uint8_t address)
{
    // Setup packet for SET_ADDRESS
    hurricane_usb_setup_packet_t setup = {
        .bmRequestType = 0x00,  // Host-to-device, standard, device
        .bRequest = 0x05,       // SET_ADDRESS
        .wValue = address,      // New device address
        .wIndex = 0x0000,       // Not used for SET_ADDRESS
        .wLength = 0            // No data phase
    };
    
    printf("[LPC55S69-Host] Setting device address to %d\n", address);
    
    // Send control transfer to set the address
    int result = hurricane_hw_host_control_transfer(
        &setup,
        NULL,
        0
    );
    
    if (result < 0) {
        printf("[LPC55S69-Host] Failed to set device address: %d\n", result);
        return kStatus_USB_Error;
    }
    
    // Update our tracking of the device address
    device_address = address;
    
    return kStatus_USB_Success;
}

/**
 * @brief Set the USB device configuration
 *
 * @param config The configuration value to set
 * @return usb_status_t Status of the operation
 */
static usb_status_t set_device_configuration(uint8_t config)
{
    // Setup packet for SET_CONFIGURATION
    hurricane_usb_setup_packet_t setup = {
        .bmRequestType = 0x00,  // Host-to-device, standard, device
        .bRequest = 0x09,       // SET_CONFIGURATION
        .wValue = config,       // Configuration value
        .wIndex = 0x0000,       // Not used for SET_CONFIGURATION
        .wLength = 0            // No data phase
    };
    
    printf("[LPC55S69-Host] Setting device configuration to %d\n", config);
    
    // Send control transfer to set the configuration
    int result = hurricane_hw_host_control_transfer(
        &setup,
        NULL,
        0
    );
    
    if (result < 0) {
        printf("[LPC55S69-Host] Failed to set device configuration: %d\n", result);
        return kStatus_USB_Error;
    }
    
    return kStatus_USB_Success;
}

/**
 * @brief Handle errors during enumeration process
 *
 * @param status The error status code
 */
static void handle_enumeration_error(usb_status_t status)
{
    enum_retries++;
    
    if (enum_retries > 3) {
        printf("[LPC55S69-Host] Enumeration failed after multiple retries\n");
        enum_state = ENUM_STATE_IDLE;
        return;
    }
    
    printf("[LPC55S69-Host] Retrying enumeration state %d (retry #%d)\n", enum_state, enum_retries);
    // Stay in the same state to retry
}

static void USB_HostHidCallback(void* param, 
                              uint8_t* buffer, 
                              uint32_t length)
{
    // Process HID data if needed
    
    // For now, just print transfer completion
    printf("[LPC55S69-Host] HID transfer complete. Length: %d\n", length);
}
